INSERT INTO public."permission" (code,"name","type",parent_id,create_time,update_time,sort) VALUES
	 (NULL,'系统管理',1,0,'2023-05-22 06:53:15.6','2023-05-22 06:53:15.6',1),
	 ('system:user','用户管理',2,1,'2023-05-22 06:54:06.737','2023-05-22 06:54:06.737',1),
	 ('system:dept','部门管理',2,1,'2023-05-22 06:54:19.439','2023-05-22 06:54:19.439',2),
	 ('system:role','角色管理',2,1,'2023-05-22 06:55:53.612','2023-05-22 06:55:53.612',3),
	 ('system:permission','权限管理',2,1,'2023-05-22 06:56:08.773','2023-05-22 06:56:08.773',4),
	 ('system:user:query','用户查询',3,2,'2023-05-22 06:56:51.704','2023-05-22 06:56:51.704',1),
	 ('system:user:add','用户新增',3,2,'2023-05-22 06:57:04.885','2023-05-22 06:57:04.885',2),
	 ('system:user:edit','用户编辑',3,2,'2023-05-22 06:57:19.081','2023-05-22 06:57:19.081',3),
	 ('system:user:delete','用户删除',3,2,'2023-05-22 06:57:33.413','2023-05-22 06:57:33.413',4),
	 ('system:user:resetPassword','重置密码',3,2,'2023-05-22 06:58:19.337','2023-05-22 06:58:19.337',5);
INSERT INTO public."permission" (code,"name","type",parent_id,create_time,update_time,sort) VALUES
	 ('system:permission:query','权限查询',3,5,'2023-05-22 07:01:34.026','2023-05-22 07:01:34.026',1),
	 ('system:permission:add','权限新增',3,5,'2023-05-22 07:01:59.943','2023-05-22 07:01:59.943',2),
	 ('system:permission:edit','权限编辑',3,5,'2023-05-22 07:02:16.807','2023-05-22 07:02:16.807',3),
	 ('system:permission:delete','权限删除',3,5,'2023-05-22 07:02:32.467','2023-05-22 07:02:32.467',4),
	 ('system:dept:add','部门新增',3,3,'2023-05-22 06:58:53.498','2023-05-22 06:58:53.498',2),
	 ('system:dept:edit','部门编辑',3,3,'2023-05-22 06:59:07.672','2023-05-22 06:59:07.672',3),
	 ('system:dept:query','部门查询',3,3,'2023-05-22 06:58:36.234','2023-05-22 06:58:36.234',1),
	 ('system:dept:delete','部门删除',3,3,'2023-05-22 06:59:34.175','2023-05-22 07:32:19.504',4),
	 ('system:role:edit','角色编辑',3,4,'2023-05-22 07:01:03.359','2023-05-22 07:32:30.485',3),
	 ('system:role:query','角色查询',2,4,'2023-05-22 06:59:49.435','2023-05-22 07:32:39.213',1);
INSERT INTO public."permission" (code,"name","type",parent_id,create_time,update_time,sort) VALUES
	 ('system:role:add','角色新增',2,4,'2023-05-22 07:00:03.564','2023-05-22 07:32:43.462',2),
	 ('system:role:delete','角色删除',2,4,'2023-05-22 07:01:19.185','2023-05-22 07:32:50.89',4);
